In [2]:
s = 'Hi there Sam'

In [3]:
s.split()

['Hi', 'there', 'Sam']

In [4]:
planet = 'Earth'
diameter = 12742
print ('The diameter of {0} is {1:.3f} kilometers'.format(planet, diameter))

The diameter of Earth is 12742.000 kilometers

In [5]:
email = 'user@domain.com'

In [6]:
email.split('@')[1]

'domain.com'

In [7]:
def dogFinder (var):
    return 'dog' in var.lower().split()

In [8]:
dogFinder ('Cats and Dog')

True

In [9]:
dogFinder ('Cows and Sheep')

False

In [10]:
def dogCounter (sent):
    count = 0
    for item in sent.lower().split():
        if item == 'dog':
            count += 1
    return count

In [11]:
dogCounter ('is there a dog here you call dog best dog ?')

3

In [12]:
seq = ['soup', 'dog', 'salad', 'cat', 'great']

In [13]:
seqFilter = list (filter (lambda x : x[0] == 's', seq))

In [14]:
seqFilter

['soup', 'salad']

In [15]:
#NUMPY!!!!!!!!!!!!!!!!!!

In [16]:
import numpy as np

In [17]:
my_list = [1,2,3]

In [18]:
arr = np.array(my_list)

In [19]:
arr

array([1, 2, 3])

In [20]:
my_mat = [[1,2,3],[4,5,6],[7,8,9]]

In [21]:
my_mat

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [22]:
np.array(my_mat)

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [114]:
np.arange(0,10,2)

array([0, 2, 4, 6, 8])

In [115]:
np.arange(1,11)

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [24]:
np.zeros((3,3))

array([[0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.]])

In [25]:
np.ones((2,3))

array([[1., 1., 1.],
       [1., 1., 1.]])

In [26]:
np.arange(0,5,1)

array([0, 1, 2, 3, 4])

In [116]:
np.linspace(0,5,50)

array([0.        , 0.10204082, 0.20408163, 0.30612245, 0.40816327,
       0.51020408, 0.6122449 , 0.71428571, 0.81632653, 0.91836735,
       1.02040816, 1.12244898, 1.2244898 , 1.32653061, 1.42857143,
       1.53061224, 1.63265306, 1.73469388, 1.83673469, 1.93877551,
       2.04081633, 2.14285714, 2.24489796, 2.34693878, 2.44897959,
       2.55102041, 2.65306122, 2.75510204, 2.85714286, 2.95918367,
       3.06122449, 3.16326531, 3.26530612, 3.36734694, 3.46938776,
       3.57142857, 3.67346939, 3.7755102 , 3.87755102, 3.97959184,
       4.08163265, 4.18367347, 4.28571429, 4.3877551 , 4.48979592,
       4.59183673, 4.69387755, 4.79591837, 4.89795918, 5.        ])

In [117]:
np.linspace (5,10,20)

array([ 5.        ,  5.26315789,  5.52631579,  5.78947368,  6.05263158,
        6.31578947,  6.57894737,  6.84210526,  7.10526316,  7.36842105,
        7.63157895,  7.89473684,  8.15789474,  8.42105263,  8.68421053,
        8.94736842,  9.21052632,  9.47368421,  9.73684211, 10.        ])

In [28]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [29]:
np.eye(8)

array([[1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 0., 0., 1.]])

In [118]:
np.random.rand(5)

array([0.73702122, 0.31015614, 0.48263279, 0.84108412, 0.69187462])

In [120]:
np.random.rand (10)

array([0.96050886, 0.09967149, 0.40486093, 0.62944218, 0.68598828,
       0.55804509, 0.26454664, 0.53135496, 0.70001521, 0.87584302])

In [122]:
np.random.randn(3,3)

array([[-0.67366054,  0.74511799,  0.29376257],
       [ 1.34440668,  0.30065779, -1.23085731],
       [ 0.51334863,  0.87179046, -0.76662502]])

In [123]:
np.random.randn(2,5)

array([[ 0.66196653, -0.75160403,  0.69922204,  0.26467247, -1.45327059],
       [ 0.09546379, -0.3589196 ,  0.53446783,  1.06857014, -0.72241005]])

In [124]:
np.random.randint (40,60,7)

array([49, 57, 42, 42, 49, 49, 49])

In [32]:
np.random.randint(5,40,22)

array([26, 32,  8, 34, 19, 12, 38, 11, 37, 38, 18, 39, 17,  5, 38,  8, 23,
       29, 39, 37, 18,  7])

In [33]:
arr = np.arange(10,35)

In [34]:
arr

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26,
       27, 28, 29, 30, 31, 32, 33, 34])

In [35]:
ranarr = np.random.randint(0,50,10)

In [36]:
ranarr

array([44, 48, 31, 34, 18, 20,  5,  7, 12, 47])

In [37]:
arr.reshape(5,5)

array([[10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24],
       [25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34]])

In [38]:
ranarr.max()

48

In [39]:
ranarr.min()

5

In [40]:
ranarr.argmax()

1

In [41]:
ranarr

array([44, 48, 31, 34, 18, 20,  5,  7, 12, 47])

In [125]:
ranarr.argmin()

6

In [126]:
ranarr.shape

(10,)

In [43]:
arr.shape

(25,)

In [44]:
arr = arr.reshape(5,5)

In [45]:
arr.shape

(5, 5)

In [46]:
arr.dtype

dtype('int32')

In [47]:
import numpy as np

In [48]:
arr = np.arange(0,11)

In [49]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [50]:
arr[3:9]

array([3, 4, 5, 6, 7, 8])

In [51]:
arr[:6]

array([0, 1, 2, 3, 4, 5])

In [52]:
 arr [0:5] = 100

In [53]:
arr

array([100, 100, 100, 100, 100,   5,   6,   7,   8,   9,  10])

In [54]:
arr = np.arange(0,11)

In [55]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [56]:
ses = np.arange (0,22)

In [57]:
ses

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21])

In [58]:
ses [7:]

array([ 7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21])

In [59]:
ses [9:21]

array([ 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20])

In [60]:
rar = np.random.randint (5,60,12)

In [61]:
rar

array([55, 28, 43, 23, 41, 59, 42, 57,  7, 59, 21, 47])

In [62]:
rar [4:7]

array([41, 59, 42])

In [63]:
rar [:]

array([55, 28, 43, 23, 41, 59, 42, 57,  7, 59, 21, 47])

In [64]:
newRar = rar [4:7]

In [65]:
newRar

array([41, 59, 42])

In [66]:
anotherRar = rar [3:8]

In [67]:
anotherRar

array([23, 41, 59, 42, 57])

In [68]:
rar

array([55, 28, 43, 23, 41, 59, 42, 57,  7, 59, 21, 47])

In [69]:
cut_rar = rar [3:6]

In [70]:
cut_rar

array([23, 41, 59])

In [71]:
cut_rar [:] = 47

In [72]:
cut_rar

array([47, 47, 47])

In [73]:
rar

array([55, 28, 43, 47, 47, 47, 42, 57,  7, 59, 21, 47])

In [74]:
rarcopy = rar.copy()

In [75]:
rarcopy

array([55, 28, 43, 47, 47, 47, 42, 57,  7, 59, 21, 47])

In [76]:
rarcopy [:] = 22

In [77]:
rarcopy

array([22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22])

In [78]:
rar

array([55, 28, 43, 47, 47, 47, 42, 57,  7, 59, 21, 47])

In [79]:
arr_2d = np.array([[3,5,7],[4,9,7],[8,1,3]])

In [80]:
arr_2d

array([[3, 5, 7],
       [4, 9, 7],
       [8, 1, 3]])

In [81]:
arr_2d [0,1]

5

In [82]:
arr_2d [1]

array([4, 9, 7])

In [83]:
arr_2d [:1]

array([[3, 5, 7]])

In [84]:
arr_2d [:,1]

array([5, 9, 1])

In [85]:
arr_2d [:,0]

array([3, 4, 8])

In [86]:
arr_2d [1:]

array([[4, 9, 7],
       [8, 1, 3]])

In [87]:
arr_2d [:2,1:]

array([[5, 7],
       [9, 7]])

In [88]:
arr_2d

array([[3, 5, 7],
       [4, 9, 7],
       [8, 1, 3]])

In [89]:
arr_2d [:, 1]

array([5, 9, 1])

In [90]:
arr_2d [1:,:2]

array([[4, 9],
       [8, 1]])

In [91]:
newMat = arr_2d[[0,0],[0,2]],[[2,0],[2,2]]

In [92]:
newMat

(array([3, 7]), [[2, 0], [2, 2]])

In [93]:
arr_2d [1:,1:]

array([[9, 7],
       [1, 3]])

In [94]:
arr_2d [:,:2:]

array([[3, 5],
       [4, 9],
       [8, 1]])

In [95]:
arr = np.arange(0,11)

In [96]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [97]:
boolarr = arr > 5

In [98]:
boolarr

array([False, False, False, False, False, False,  True,  True,  True,
        True,  True])

In [99]:
arr[boolarr]

array([ 6,  7,  8,  9, 10])

In [100]:
bool_arr = arr < 5

In [101]:
bool_arr

array([ True,  True,  True,  True,  True, False, False, False, False,
       False, False])

In [102]:
arr [bool_arr]

array([0, 1, 2, 3, 4])

In [103]:
arr [arr<3]

array([0, 1, 2])

In [106]:
 arr2d = np.arange (40).reshape(5,8)

In [107]:
arr2d

array([[ 0,  1,  2,  3,  4,  5,  6,  7],
       [ 8,  9, 10, 11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20, 21, 22, 23],
       [24, 25, 26, 27, 28, 29, 30, 31],
       [32, 33, 34, 35, 36, 37, 38, 39]])

In [108]:
arr2d [:3, 5:]

array([[ 5,  6,  7],
       [13, 14, 15],
       [21, 22, 23]])

In [112]:
newarr = arr2d [1:4,2:5]

In [111]:
arr2d.reshape(4,10)

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39]])

In [113]:
arr2d [1:3,3:5]

array([[11, 12],
       [19, 20]])

In [127]:
#NUMPY OPERATIONS

In [128]:
"""
Array with array
Array with scalars
Universal Array functions
"""

'\nArray with array\nArray with scalars\nUniversal Array functions\n'

In [129]:
import numpy as soj

In [130]:
arr = soj.arange (0,11)

In [131]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [132]:
arr * 2

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18, 20])

In [134]:
arr ** 2

array([  0,   1,   4,   9,  16,  25,  36,  49,  64,  81, 100], dtype=int32)

In [135]:
arr * 100

array([   0,  100,  200,  300,  400,  500,  600,  700,  800,  900, 1000])

In [136]:
arr / 8

array([0.   , 0.125, 0.25 , 0.375, 0.5  , 0.625, 0.75 , 0.875, 1.   ,
       1.125, 1.25 ])

In [137]:
arr +6

array([ 6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16])

In [138]:
arr / arr

C:\Users\OWNER\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in true_divide
  """Entry point for launching an IPython kernel.

array([nan,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.])

In [139]:
1 / arr

C:\Users\OWNER\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: divide by zero encountered in true_divide
  """Entry point for launching an IPython kernel.

array([       inf, 1.        , 0.5       , 0.33333333, 0.25      ,
       0.2       , 0.16666667, 0.14285714, 0.125     , 0.11111111,
       0.1       ])

In [140]:
arr1 = soj.arange (4,12)

In [141]:
arr2 = soj.arange (7,19)

In [144]:
arr1.reshape (4,2)

array([[ 4,  5],
       [ 6,  7],
       [ 8,  9],
       [10, 11]])

##

In [146]:
arr2.reshape (3,4)

array([[ 7,  8,  9, 10],
       [11, 12, 13, 14],
       [15, 16, 17, 18]])

In [147]:
arr1 + arr2

ValueError: operands could not be broadcast together with shapes (8,) (12,)

In [148]:
soj.sqrt(arr1)

array([2.        , 2.23606798, 2.44948974, 2.64575131, 2.82842712,
       3.        , 3.16227766, 3.31662479])

In [149]:
soj.exp (arr)

array([1.00000000e+00, 2.71828183e+00, 7.38905610e+00, 2.00855369e+01,
       5.45981500e+01, 1.48413159e+02, 4.03428793e+02, 1.09663316e+03,
       2.98095799e+03, 8.10308393e+03, 2.20264658e+04])

In [150]:
soj.max(arr2)

18

In [151]:
soj.argmax(arr2)

11

In [152]:
arr2

array([ 7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18])

In [153]:
soj.cos(arr2)

array([ 0.75390225, -0.14550003, -0.91113026, -0.83907153,  0.0044257 ,
        0.84385396,  0.90744678,  0.13673722, -0.75968791, -0.95765948,
       -0.27516334,  0.66031671])

In [156]:
arr2.max()

18

In [158]:
soj.log(arr2)

array([1.94591015, 2.07944154, 2.19722458, 2.30258509, 2.39789527,
       2.48490665, 2.56494936, 2.63905733, 2.7080502 , 2.77258872,
       2.83321334, 2.89037176])

In [159]:
base = 4
height = 3

In [161]:
print ('The hypotenuse of the triangle is :',soj.hypot(base,height))

The hypotenuse of the triangle is : 5.0

In [162]:
weight = soj.random.randint(40,100,8)

In [163]:
weight

array([45, 48, 78, 54, 67, 89, 71, 77])

In [167]:
print ('The mean weight of the 8 students in the class is :',soj.mean(weight),'kg')

The mean weight of the 8 students in the class is : 66.125 kg

In [168]:
jack = soj.arange (2, 20, 4)
jill = soj.arange (3, 21, 4)

In [169]:
jack

array([ 2,  6, 10, 14, 18])

In [170]:
jill

array([ 3,  7, 11, 15, 19])

In [177]:
print ("the bitwise of two arrays:",soj.invert(jill))

the bitwise of two arrays: [ 2  6 10 14 18]

In [178]:
#NUMPY EXERCISES

In [179]:
import numpy as np

In [181]:
np.zeros (10)

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [184]:
arr = np.ones (10)

In [185]:
newarr = arr * 5

In [186]:
newarr

array([5., 5., 5., 5., 5., 5., 5., 5., 5., 5.])

In [189]:
np.arange (10,51)

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26,
       27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43,
       44, 45, 46, 47, 48, 49, 50])

In [190]:
np.arange (10,51,2)

array([10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42,
       44, 46, 48, 50])

In [228]:
arr3x3 = np.random.randint (0,8,9).reshape(3,3)

In [229]:
arr3x3

array([[2, 2, 3],
       [5, 4, 3],
       [7, 1, 6]])

In [194]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [197]:
np.random.rand(1)

array([0.59169587])

In [198]:
stdarr = np.random.randn(25)

In [199]:
stdarr.reshape (5,5)

array([[ 1.21484566, -0.35340165,  1.68532932,  0.02434348, -0.14513546],
       [ 0.44206693,  2.00354316, -1.13983764, -0.12698935, -0.32694917],
       [-0.11233582,  0.73316336,  0.02805181, -0.98298717,  1.14823015],
       [-0.52141889, -0.17474657,  1.66840534, -0.75825418, -0.06039869],
       [ 1.50506277, -0.59660142, -0.62847265, -0.20897092, -0.66590203]])

In [231]:
np.arange (0.01,1.01,0.01).reshape (10,10)

array([[0.01, 0.02, 0.03, 0.04, 0.05, 0.06, 0.07, 0.08, 0.09, 0.1 ],
       [0.11, 0.12, 0.13, 0.14, 0.15, 0.16, 0.17, 0.18, 0.19, 0.2 ],
       [0.21, 0.22, 0.23, 0.24, 0.25, 0.26, 0.27, 0.28, 0.29, 0.3 ],
       [0.31, 0.32, 0.33, 0.34, 0.35, 0.36, 0.37, 0.38, 0.39, 0.4 ],
       [0.41, 0.42, 0.43, 0.44, 0.45, 0.46, 0.47, 0.48, 0.49, 0.5 ],
       [0.51, 0.52, 0.53, 0.54, 0.55, 0.56, 0.57, 0.58, 0.59, 0.6 ],
       [0.61, 0.62, 0.63, 0.64, 0.65, 0.66, 0.67, 0.68, 0.69, 0.7 ],
       [0.71, 0.72, 0.73, 0.74, 0.75, 0.76, 0.77, 0.78, 0.79, 0.8 ],
       [0.81, 0.82, 0.83, 0.84, 0.85, 0.86, 0.87, 0.88, 0.89, 0.9 ],
       [0.91, 0.92, 0.93, 0.94, 0.95, 0.96, 0.97, 0.98, 0.99, 1.  ]])

In [233]:
np.linspace (0.01,1,100).reshape (10,10)

array([[0.01, 0.02, 0.03, 0.04, 0.05, 0.06, 0.07, 0.08, 0.09, 0.1 ],
       [0.11, 0.12, 0.13, 0.14, 0.15, 0.16, 0.17, 0.18, 0.19, 0.2 ],
       [0.21, 0.22, 0.23, 0.24, 0.25, 0.26, 0.27, 0.28, 0.29, 0.3 ],
       [0.31, 0.32, 0.33, 0.34, 0.35, 0.36, 0.37, 0.38, 0.39, 0.4 ],
       [0.41, 0.42, 0.43, 0.44, 0.45, 0.46, 0.47, 0.48, 0.49, 0.5 ],
       [0.51, 0.52, 0.53, 0.54, 0.55, 0.56, 0.57, 0.58, 0.59, 0.6 ],
       [0.61, 0.62, 0.63, 0.64, 0.65, 0.66, 0.67, 0.68, 0.69, 0.7 ],
       [0.71, 0.72, 0.73, 0.74, 0.75, 0.76, 0.77, 0.78, 0.79, 0.8 ],
       [0.81, 0.82, 0.83, 0.84, 0.85, 0.86, 0.87, 0.88, 0.89, 0.9 ],
       [0.91, 0.92, 0.93, 0.94, 0.95, 0.96, 0.97, 0.98, 0.99, 1.  ]])

In [202]:
np.linspace(0,1,20)

array([0.        , 0.05263158, 0.10526316, 0.15789474, 0.21052632,
       0.26315789, 0.31578947, 0.36842105, 0.42105263, 0.47368421,
       0.52631579, 0.57894737, 0.63157895, 0.68421053, 0.73684211,
       0.78947368, 0.84210526, 0.89473684, 0.94736842, 1.        ])

In [203]:
vat = np.arange(1,26).reshape(5,5)
vat

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [235]:
vat[2:,:]

array([[11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [238]:
vat[2:,1:]

array([[12, 13, 14, 15],
       [17, 18, 19, 20],
       [22, 23, 24, 25]])

In [240]:
vat[3,4]

20

In [241]:
vat

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [242]:
vat[:3,1:2]

array([[ 2],
       [ 7],
       [12]])

In [244]:
vat [1:4,2:3]

array([[ 8],
       [13],
       [18]])

In [218]:
vat [4]

array([21, 22, 23, 24, 25])

In [220]:
vat [3:]

array([[16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [248]:
np.sum(vat, axis = 0, dtype = float)

array([55., 60., 65., 70., 75.])

In [226]:
np.std(vat)

7.211102550927978

In [245]:
vat.std()

7.211102550927978

In [249]:
#PANDAS !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

In [250]:
#SERIES

In [251]:
import numpy as np

In [252]:
import pandas as pd

In [253]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array (my_data)
d = {'a':10,'b':20,'c':30}

In [255]:
my_data

[10, 20, 30]

In [258]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [261]:
pd.Series(data = my_data, index = labels )

a    10
b    20
c    30
dtype: int64

In [262]:
pd.Series (arr)

0    10
1    20
2    30
dtype: int32

In [263]:
d

{'a': 10, 'b': 20, 'c': 30}

In [266]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [340]:
pd.Series ([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [343]:
pd.Series (['df','rt', 'gh'],['oo','pp','qq'])

oo    df
pp    rt
qq    gh
dtype: object

In [271]:
ser1 = pd.Series ([1,2,3,4],['USA','Germany','Japan','Russia'])

In [272]:
ser1

USA        1
Germany    2
Japan      3
Russia     4
dtype: int64

In [273]:
ser2 = pd.Series ([1,2,5,4],['USA','Germany','Italy','Russia'])

In [274]:
ser2

USA        1
Germany    2
Italy      5
Russia     4
dtype: int64

In [276]:
ser2['Italy']

5

In [278]:
ser3 = pd.Series (['USA','Germany','Italy','Russia'],[1,2,5,4])

In [279]:
ser3

1        USA
2    Germany
5      Italy
4     Russia
dtype: object

In [280]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      NaN
Russia     8.0
USA        2.0
dtype: float64

In [281]:
#DATAFRAMES

In [282]:
 from numpy.random import randn

In [344]:
np.random.seed(101)

In [347]:
fd = pd.DataFrame(randn(6,6),[1,2,3,4,5,6],['Black','Red','White','Yellow','Green','Blue'])

In [348]:
fd

      Black       Red     White    Yellow     Green      Blue
1 -0.116773  1.901755  0.238127  1.996652 -0.993263  0.196800
2 -1.136645  0.000366  1.025984 -0.156598 -0.031579  0.649826
3  2.154846 -0.610259 -0.755325 -0.346419  0.147027 -0.479448
4  0.558769  1.024810 -0.925874  1.862864 -1.133817  0.610478
5  0.386030  2.084019 -0.376519  0.230336  0.681209  1.035125
6 -0.031160  1.939932 -1.005187 -0.741790  0.187125 -0.732845

In [284]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [285]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [289]:
'''
Dataframe is just a bunch of series that share the same index;
WXYZ are individual series while ABCDE are indexes
'''

'\nDataframe is just a bunch of series that all share an index;\nWXYZ are individual series while ABCDE are indexes\n'

In [290]:
from numpy.random import randint

In [293]:
new_tab = pd.DataFrame (randn(4,3),['A','B','C','D'],['Apples','Oranges','Kiwis'])

In [294]:
new_tab

     Apples   Oranges     Kiwis
A  0.302665  1.693723 -1.706086
B -1.159119 -0.134841  0.390528
C  0.166905  0.184502  0.807706
D  0.072960  0.638787  0.329646

In [295]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [296]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [297]:
type(df['W'])

pandas.core.series.Series

In [298]:
type(df)

pandas.core.frame.DataFrame

In [299]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [307]:
df [['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [314]:
df['new'] = df['W'] + df['Y']

In [315]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [319]:
df.drop('new',axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [320]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [321]:
df.drop('new',axis = 1,inplace = True)

In [322]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [324]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [325]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [326]:
df.shape

(5, 4)

In [329]:
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [330]:
df.iloc [1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [335]:
new = pd.DataFrame(randn (3,2),['a','b','c'],['x','y'])

In [336]:
new

          x         y
a -0.497104 -0.754070
b -0.943406  0.484752
c -0.116773  1.901755

In [337]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [338]:
df.loc ['C','Y']

0.5288134940893595

In [377]:
df.loc [['C','E'],['X','Z']]

          X         Z
C  0.740122 -0.589001
E  1.978757  0.683509

In [378]:
#MORE DATAFRAME LECTURES:CONDITIONAL SELECTION

In [389]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [390]:
dfr = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [391]:
dfr

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [392]:
booldf = dfr > 0

In [393]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [394]:
dfr[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [395]:
dfr

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [396]:
dfr ['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [397]:
dfr ['Y'] == 0

A    False
B    False
C    False
D    False
E    False
Name: Y, dtype: bool

In [398]:
dfr [dfr ['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [399]:
dfr [dfr ['Y'] == 0]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [373]:
#grab all the rows in the dataframe where C < 0

In [374]:
dfr.loc ['C'] < 0

W    False
X    False
Y    False
Z    False
Name: C, dtype: bool

In [400]:
[dfr ['Z'] < 0]

[A    False
 B    False
 C     True
 D    False
 E    False
 Name: Z, dtype: bool]

In [409]:
resultdfr = dfr [dfr ['W'] > 0]

In [414]:
resultdfr ['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [417]:
dfr [dfr ['W'] > 0][['X','Y','Z']]

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [418]:
dfr [dfr ['W'] > 0][['Z','X','Y']]

          Z         X         Y
A  0.503826  0.628133  0.907969
B  0.605965 -0.319318 -0.848077
D  0.955057 -0.758872 -0.933237
E  0.683509  1.978757  2.605967

In [420]:
frac = dfr ['W'] > 0
newfrac = dfr[frac]
my_cols = ['Z','X','Y']
newfrac[my_cols]

          Z         X         Y
A  0.503826  0.628133  0.907969
B  0.605965 -0.319318 -0.848077
D  0.955057 -0.758872 -0.933237
E  0.683509  1.978757  2.605967

In [421]:
dfr [(dfr ['W'] > 0) & (dfr ['Y'] > 0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [422]:
dfr [(dfr ['W'] > 0) | (dfr ['Y'] > 0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [424]:
dfr.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [425]:
newind = 'CA NY WY OR CO'.split()

In [426]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [427]:
dfr_copy = dfr.copy()

In [428]:
dfr_copy

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [429]:
dfr_copy['States'] = newind

In [430]:
dfr_copy

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [434]:
dfr_copy.set_index('States', inplace = True)

In [436]:
dfr_copy

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [438]:
'''MULTIPLE CONDITIONAL SELECTION RECAP'''

'MULTIPLE CONDITIONAL SELECTION RECAP'

In [439]:
dfr_copy [(dfr_copy ['X']) > 0 & (dfr_copy ['Y'] < 0)]

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
WY     -2.018168  0.740122  0.528813 -0.589001
CO      0.190794  1.978757  2.605967  0.683509

In [441]:
dfr_copy [(dfr_copy['W'] < 0) | (dfr_copy ['Z'] > 0)]

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [446]:
additional_column = pd.Series (randn(5))

In [447]:
additional_column

0    0.390528
1    0.166905
2    0.184502
3    0.807706
4    0.072960
dtype: float64

In [448]:
dfr_copy ['A'] = additional_column

In [449]:
dfr_copy

               W         X         Y         Z   A
States
CA      2.706850  0.628133  0.907969  0.503826 NaN
NY      0.651118 -0.319318 -0.848077  0.605965 NaN
WY     -2.018168  0.740122  0.528813 -0.589001 NaN
OR      0.188695 -0.758872 -0.933237  0.955057 NaN
CO      0.190794  1.978757  2.605967  0.683509 NaN

In [442]:
#DATAFRAMES PART 3

In [450]:
#GROUP BY W/ PANDAS

In [451]:
import numpy as np
import pandas as pd

In [452]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanesssa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [453]:
df = pd.DataFrame(data)

In [454]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Vanesssa    124
4      FB      Carl    243
5      FB     Sarah    350

In [456]:
compgrp = df.groupby('Company')

In [457]:
compgrp

In [461]:
compgrp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [462]:
compgrp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [464]:
compgrp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [471]:
compgrp.mean().loc['GOOG']

Sales    160.0
Name: GOOG, dtype: float64

In [472]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [473]:
df.groupby('Company').mean().loc['MSFT']

Sales    232.0
Name: MSFT, dtype: float64

In [481]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [488]:
#MERGING, JOINING AND CONCATENATING DATAFRAMES

In [490]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                  index = [0,1,2,3])

In [491]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                    'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                  index = [4,5,6,7])

In [496]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                    'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']},
                  index = [8,9,10,11])

In [493]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [494]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [497]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [499]:
pd.concat ([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [500]:
pd.concat ([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [484]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [485]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [486]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [487]:
pd.merge(left,right,how = 'inner',on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [501]:
left = pd.DataFrame({'key1':['K0','K0','K1','K2'],
                     'key2':['K0','K1','K0','K1'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key1':['K0','K1','K1','K2'],
                      'key2':['K0','K0','K0','K0'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [503]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [504]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [505]:
pd.merge (left, right, on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [506]:
pd.merge (left, right, how = 'inner', on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [507]:
pd.merge (left, right, how = 'outer', on = ['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [508]:
pd.merge (left, right, how = 'left', on = ['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [509]:
pd.merge (left, right, how = 'right', on = ['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [516]:
left = pd.DataFrame ({'A':['A0','A1','A2'],
                    'B':['B0','B1','B2']},
                   index = ['K0','K1','K2'])

right = pd.DataFrame ({'C':['C0','C2','C3'],
                    'D':['D0','D2','D3']},
                    index = ['K0','K2','K3'])

In [517]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [518]:
 right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [519]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [520]:
#OPERATIONS IN PANDAS

In [523]:
df = pd.DataFrame ({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [524]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [525]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [530]:
len(df['col2'].unique())
df['col2'].nunique()

3

In [531]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [532]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [535]:
df [(df ['col1'] > 2) | (df ['col2'] == 444)]

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

In [537]:
def times2 (x):
    return x*2

In [538]:
df ['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [539]:
df ['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [541]:
df ['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [542]:
times2 = lambda x : x*2

In [543]:
df ['col2'].apply(lambda x : x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [544]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [549]:
df.drop('col1', axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [551]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [552]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [553]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [554]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [555]:
fd = pd.DataFrame ({'A':['foo','foo','foo','bar','bar','bar'],
                   'B':['one','one','two','two','one','one'],
                   'C':['x','y','x','y','x','y'],
                   'D':[1,3,2,5,4,1]})

In [556]:
fd

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [563]:
fd['A'].unique()

array(['foo', 'bar'], dtype=object)

In [562]:
fd['D'].nunique()

5

In [564]:
fd

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [565]:
fd.pivot_table(values = 'D', index = ['A','B'], columns  = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [566]:
# DATA INPUT AND OUTPUT

In [567]:
 """
 DATA INPUT AND OUTPUT
 -CSV
 -Excel
 -HTML
 -SQL
 """

'\nDATA INPUT AND OUTPUT\n-CSV\n-Excel\n-HTML\n-SQL\n'

In [568]:
pwd

'C:\\Users\\OWNER'

In [572]:
pd.read_csv('cigarette-smoking-behaviour-2018-census-csv.csv')

          Code         Smoking behavior  15 and over population
0            1           Regular smoker                  498996
1            2                Ex-smoker                  832104
2            3   Never smoked regularly                 2445252
3            7  Response unidentifiable                       0
4            9               Not stated                       0
5  TotalStated             Total stated                 3776355
6        Total                    Total                 3776355

In [573]:
df = pd.read_csv('cigarette-smoking-behaviour-2018-census-csv.csv')

In [577]:
df.to_csv('My_output', index = False)

In [578]:
pd.read_csv('My_output')

          Code         Smoking behavior  15 and over population
0            1           Regular smoker                  498996
1            2                Ex-smoker                  832104
2            3   Never smoked regularly                 2445252
3            7  Response unidentifiable                       0
4            9               Not stated                       0
5  TotalStated             Total stated                 3776355
6        Total                    Total                 3776355

In [582]:
pd.read_excel('Book1.xlsx')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [590]:
 epl = pd.read_html('https://www.theguardian.com/football/premierleague/table')

In [592]:
type (epl)

list

In [596]:
champs = epl [0].head()

In [598]:
champs

,P,Team,GP,W,D,L,F,A,GD,Pts,Form
0,1,Liverpool,29,27,1,1,66,21,45,82,Won against Southampton Won against Norwich Wo...
1,2,Man City,28,18,3,7,68,31,37,57,Won against Sheff Utd Lost to Spurs Won agains...
2,3,Leicester,29,16,5,8,58,28,30,53,Drew with Chelsea Drew with Wolves Lost to Man...
3,4,Chelsea,29,14,6,9,51,39,12,48,Drew with Leicester Lost to Man Utd Won agains...
4,5,Man Utd,29,12,9,8,44,30,14,45,Drew with Wolves Won against Chelsea Won again...

In [599]:
champs

,P,Team,GP,W,D,L,F,A,GD,Pts,Form
0,1,Liverpool,29,27,1,1,66,21,45,82,Won against Southampton Won against Norwich Wo...
1,2,Man City,28,18,3,7,68,31,37,57,Won against Sheff Utd Lost to Spurs Won agains...
2,3,Leicester,29,16,5,8,58,28,30,53,Drew with Chelsea Drew with Wolves Lost to Man...
3,4,Chelsea,29,14,6,9,51,39,12,48,Drew with Leicester Lost to Man Utd Won agains...
4,5,Man Utd,29,12,9,8,44,30,14,45,Drew with Wolves Won against Chelsea Won again...

In [600]:
champs ['Form']

0    Won against Southampton Won against Norwich Wo...
1    Won against Sheff Utd Lost to Spurs Won agains...
2    Drew with Chelsea Drew with Wolves Lost to Man...
3    Drew with Leicester Lost to Man Utd Won agains...
4    Drew with Wolves Won against Chelsea Won again...
Name: Form, dtype: object

In [601]:
from sqlalchemy import create_engine

In [602]:
engine = create_engine ('sqlite:///:memory:')

In [603]:
df

          Code         Smoking behavior  15 and over population
0            1           Regular smoker                  498996
1            2                Ex-smoker                  832104
2            3   Never smoked regularly                 2445252
3            7  Response unidentifiable                       0
4            9               Not stated                       0
5  TotalStated             Total stated                 3776355
6        Total                    Total                 3776355

In [604]:
 df.to_sql('my_tableau',engine)

In [605]:
sqldf = pd.read_sql('my_tableau', con = engine)

In [606]:
sqldf

   index         Code         Smoking behavior  15 and over population
0      0            1           Regular smoker                  498996
1      1            2                Ex-smoker                  832104
2      2            3   Never smoked regularly                 2445252
3      3            7  Response unidentifiable                       0
4      4            9               Not stated                       0
5      5  TotalStated             Total stated                 3776355
6      6        Total                    Total                 3776355

In [607]:
#EXERCISES ON PANDAS

In [608]:
import pandas as pd

In [622]:
sal = pd.read_csv('Salaries.csv')

C:\Users\OWNER\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (12) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [623]:
sal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148642,148643,Dominic C Marquez,Sign Worker,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,PT
148643,148644,Kim Brewer,Parking Control Officer,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,PT
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,PT
148645,148646,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,PT
148646,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,PT

In [627]:
readsal = sal.head(5)

In [625]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148647 entries, 0 to 148646
Data columns (total 13 columns):
Id                  148647 non-null int64
EmployeeName        148647 non-null object
JobTitle            148647 non-null object
BasePay             148042 non-null float64
OvertimePay         148647 non-null float64
OtherPay            148647 non-null float64
Benefits            112488 non-null float64
TotalPay            148647 non-null float64
TotalPayBenefits    148647 non-null float64
Year                148647 non-null int64
Notes               0 non-null float64
Agency              148647 non-null object
Status              38116 non-null object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

In [626]:
sal['BasePay'].mean()

66326.79289385969

In [628]:
readsal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [629]:
sal ['OvertimePay'].max()

245131.88

In [633]:
sal [sal ['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [635]:
forseph = sal ['EmployeeName'] == 'JOSEPH DRISCOLL'

In [637]:
forseph

0         False
1         False
2         False
3         False
4         False
          ...
148642    False
148643    False
148644    False
148645    False
148646    False
Name: EmployeeName, Length: 148647, dtype: bool

In [640]:
forseph.iloc [24]

True

In [643]:
sal [forseph]['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [645]:
sal[forseph]['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [646]:
sal [sal ['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [702]:
sal [sal ['TotalPayBenefits'] == max(sal['TotalPayBenefits'])]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,TitleLen
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,46

In [710]:
sal [sal ['TotalPayBenefits'] == sal ['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [712]:
sal[sal ["TotalPayBenefits"] == min(sal["TotalPayBenefits"])]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,TitleLen
148646,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,PT,26

In [713]:
sal.iloc[sal['TotalPayBenefits'].argmin()]

C:\Users\OWNER\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
The current behaviour of 'Series.argmin' is deprecated, use 'idxmin'
instead.
The behavior of 'argmin' will be corrected to return the positional
minimum in the future. For now, use 'series.values.argmin' or
'np.argmin(np.array(values))' to get the position of the minimum
row.
  """Entry point for launching an IPython kernel.

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                      0
OvertimePay                                  0
OtherPay                               -618.13
Benefits                                     0
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                      PT
TitleLen                                    26
Name: 148646, dtype: object

In [658]:
sal.groupby('Year').mean ()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66569.661017
Name: BasePay, dtype: float64

In [659]:
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66569.661017
Name: BasePay, dtype: float64

In [662]:
sal['JobTitle'].nunique()

2158

In [666]:
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [675]:
onejob = sal [sal ['Year'] == 2013]['JobTitle'].value_counts()

In [681]:
arr = onejob[onejob == 1].sum()
arr

202

In [691]:
def chiefinder (var):
    count = 0
    if 'chief' in var.lower().split():
        count = count + 1
        return count

In [692]:
chiefolder = sal['JobTitle']

In [697]:
chiefolder.apply(chiefinder).sum()

477.0

In [698]:
readsal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [699]:
sal ['TitleLen'] = sal ['JobTitle'].apply(len)

In [700]:
sal [['TitleLen','TotalPayBenefits']].corr()

                  TitleLen  TotalPayBenefits
TitleLen          1.000000         -0.036938
TotalPayBenefits -0.036938          1.000000

In [714]:
#ANOTHER EXERCISE

In [719]:
ecom = pd.read_csv('Ecommerce Purchases.csv')

In [720]:
ecom.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [722]:
ecom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
Address             10000 non-null object
Lot                 10000 non-null object
AM or PM            10000 non-null object
Browser Info        10000 non-null object
Company             10000 non-null object
Credit Card         10000 non-null int64
CC Exp Date         10000 non-null object
CC Security Code    10000 non-null int64
CC Provider         10000 non-null object
Email               10000 non-null object
Job                 10000 non-null object
IP Address          10000 non-null object
Language            10000 non-null object
Purchase Price      10000 non-null float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

In [727]:
ecom.mean()['Purchase Price']

50.34730200000025

In [728]:
ecom['Purchase Price'].max()

99.99

In [729]:
ecom['Purchase Price'].min()

0.0

In [741]:
ecom[ecom['Language'] == 'en'].count()

Address             1098
Lot                 1098
AM or PM            1098
Browser Info        1098
Company             1098
Credit Card         1098
CC Exp Date         1098
CC Security Code    1098
CC Provider         1098
Email               1098
Job                 1098
IP Address          1098
Language            1098
Purchase Price      1098
dtype: int64

In [739]:
ecom[ecom ['Job'] == 'Lawyer'].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30 entries, 470 to 9979
Data columns (total 14 columns):
Address             30 non-null object
Lot                 30 non-null object
AM or PM            30 non-null object
Browser Info        30 non-null object
Company             30 non-null object
Credit Card         30 non-null int64
CC Exp Date         30 non-null object
CC Security Code    30 non-null int64
CC Provider         30 non-null object
Email               30 non-null object
Job                 30 non-null object
IP Address          30 non-null object
Language            30 non-null object
Purchase Price      30 non-null float64
dtypes: float64(1), int64(2), object(11)
memory usage: 3.5+ KB

In [751]:
ecom['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

In [755]:
ecom ["Job"].value_counts().head()

Interior and spatial designer    31
Lawyer                           30
Social researcher                28
Designer, jewellery              27
Purchasing manager               27
Name: Job, dtype: int64

In [758]:
ecom [ecom ['Lot'] == '90 WT']['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

In [759]:
ecom.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [765]:
ecom [ecom ['Credit Card'] == 4926535242672853]['Email']

1234    bondellen@williams-garza.com
Name: Email, dtype: object

In [778]:
ecom [(ecom ['CC Provider'] == 'American Express') & (ecom ['Purchase Price'] > 95)]

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
9,"3795 Dawson Extensions\nLake Tinafort, ID 88739",15 Ug,AM,Mozilla/5.0 (X11; Linux i686; rv:1.9.7.20) Gec...,"Rivera, Buchanan and Ramirez",4396283918371,01/17,931,American Express,qcoleman@hunt-huerta.com,Forensic scientist,236.198.199.8,zh,95.63
280,81060 Dustin Causeway Apt. 503\nPort Danielche...,80 zh,PM,Mozilla/5.0 (Windows NT 5.01) AppleWebKit/5362...,Clay PLC,377737470673585,10/17,349,American Express,hfarley@hicks.com,Ergonomist,134.52.148.32,de,99.13
372,"359 Stanley Coves\nSalasfort, SD 59457",75 Ub,PM,Opera/8.42.(X11; Linux x86_64; en-US) Presto/2...,Davis-Lawrence,371995567939253,02/26,1877,American Express,amberhull@jones.net,Training and development officer,198.98.34.250,pt,99.08
677,"4855 Peter Bridge\nJohnsonberg, PA 90599-0009",62 Nx,AM,Opera/9.49.(Windows 98; Win 9x 4.90; en-US) Pr...,Jones and Sons,4960556611626434,07/26,9255,American Express,evanskayla@fernandez.com,Plant breeder/geneticist,235.97.240.112,el,98.97
766,"386 Alisha Unions\nSteelebury, ND 19782",28 pJ,PM,Opera/8.47.(X11; Linux x86_64; sl-SI) Presto/2...,Proctor PLC,30325623350308,04/24,772,American Express,robertsonjulia@gmail.com,"Therapist, art",146.208.30.83,es,96.66
1225,"916 Amanda Heights\nNew Johnland, CA 52112-8572",09 vg,PM,Mozilla/5.0 (X11; Linux i686; rv:1.9.7.20) Gec...,"Clark, Ross and Travis",371229555854245,10/21,366,American Express,lawrencecarter@kelly.com,Artist,88.49.59.205,pt,96.55
1381,"79284 Lisa Mews Suite 069\nKellyborough, CT 71...",45 MR,PM,Mozilla/5.0 (Macintosh; PPC Mac OS X 10_5_5; r...,Randall-Cohen,4855262855037,05/17,518,American Express,maldonadomichael@martinez-delgado.info,Geophysical data processor,50.40.147.204,it,96.11
1385,"67796 James Keys Suite 656\nSouth Katieshire, ...",06 ia,PM,Mozilla/5.0 (Windows NT 5.1) AppleWebKit/5330 ...,"Gonzalez, Gross and Allen",30407332938506,12/20,597,American Express,vbrown@daugherty.com,Geophysical data processor,152.133.246.191,zh,98.89
1568,"76108 Barker Manors\nEast Amy, PW 49544-5921",82 Qw,AM,Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...,"Nguyen, Branch and Wiley",5142451859832464,04/21,785,American Express,johnsonjulie@yahoo.com,Insurance claims handler,175.248.232.126,es,97.04
1727,"478 Anita Hill Apt. 766\nAverymouth, FM 50629-...",94 qM,AM,Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...,Owen and Sons,30242757909967,11/19,7403,American Express,sharpmelanie@smith-johnson.com,"Psychologist, prison and probation services",126.47.196.22,ru,95.58
2146,"557 Barton Harbor\nFuentesport, VI 29961",96 MV,AM,Mozilla/5.0 (compatible; MSIE 6.0; Windows 98;...,Flores-Cook,3337255995040373,04/19,28,American Express,jessica94@mosley-buchanan.com,Armed forces technical officer,35.97.189.19,es,98.01
2264,"040 Ingram Way Suite 602\nEast Matthew, AR 67341",52 WA,AM,Mozilla/5.0 (Windows NT 6.0) AppleWebKit/5341 ...,"Baker, Simmons and Pitts",3096946456575623,11/22,56,American Express,holtamanda@gmail.com,Archaeologist,185.14.106.115,es,99.85
2267,"216 Olivia Court Apt. 439\nTonyshire, IN 19159...",11 za,PM,Mozilla/5.0 (Macintosh; PPC Mac OS X 10_6_4; r...,Olson Inc,5388757330269354,02/17,738,American Express,burkestephanie@lee-cameron.com,Management consultant,20.140.16.225,it,97.63
2642,899 Williams Prairie Suite 234\nEast Hunterbur...,46 hb,PM,Mozilla/5.0 (compatible; MSIE 7.0; Windows NT ...,Webb Inc,3096797127305092,05/17,418,American Express,reevesmanuel@gmail.com,"Engineer, maintenance (IT)",169.132.152.152,el,96.08
2828,"20135 Miller Green Apt. 763\nGarciaville, KY 6...",79 El,PM,Mozilla/5.0 (Windows; U; Windows CE) AppleWebK...,"Zavala, Cox and Parker",5173968976288215,11/22,125,American Express,villarrealdavid@gray.com,Chartered management accountant,76.75.229.58,el,96.12
3291,"58939 Reese Cove\nSouth Ross, MA 54531",50 cD,AM,Mozilla/5.0 (compatible; MSIE 9.0; Windows 95;...,"Chang, Davis and Snyder",349464844934636,11/23,103,American Express,stephanieacosta@yahoo.com,IT trainer,124.247.101.106,it,95.94
3349,1984 Christopher Turnpike Suite 904\nRichardbu...,30 xs,AM,Mozilla/5.0 (X11; Linux x86_64; rv:1.9.7.20) G...,Martin-Mitchell,3096398727024637,03/19,439,American Express,hgross@mccoy-mckay.info,Structural engineer,167.172.139.33,pt,95.46
3619,"03233 Angela Road Apt. 808\nEast Jilliantown, ...",41 nH,PM,Opera/9.53.(Windows 95; en-US) Presto/2.9.175 ...,"Silva, Kim and Martinez",4807251488895729,10/21,948,American Express,jonesjesse@castro.info,Garment/textile technologist,87.66.16.4,en,99.69
4071,"8161 Craig Passage Apt. 939\nPort Emilystad, R...",45 ab,AM,Mozilla/5.0 (Windows; U; Windows NT 6.1) Apple...,Wilson-Robinson,5506767693718324,08/23,18,American Express,hhenderson@yahoo.com,Customer service manager,119.74.76.168,es,96.49
4569,"88284 Austin Summit Apt. 805\nKellerside, WY 6...",03 WL,AM,Mozilla/5.0 (Macintosh; U; PPC Mac OS X 10_5_5...,"Fisher, Thompson and Lynch",3088726880694574,12/19,159,American Express,amy00@patton.com,Actuary,207.18.223.8,el,97.38
5385,USNS Smith\nFPO AA 37829,80 BX,AM,Opera/9.56.(X11; Linux x86_64; en-US) Presto/2...,Patterson-Miller,4411786056713950,12/22,452,American Express,ijones@hotmail.com,Field seismologist,251.254.250.100,el,96.13
5655,"38674 Mckay Vista\nWilsonbury, MO 55611-8663",95 aB,PM,Mozilla/5.0 (X11; Linux i686) AppleWebKit/5331...,Watson-Bailey,3096820981608615,05/20,259,American Express,timothy84@hotmail.com,"Production designer, theatre/television/film",235.149.102.129,es,98.28
5692,"PSC 8264, Box 8124\nAPO AE 19700",97 sG,PM,Mozilla/5.0 (iPod; U; CPU iPhone OS 3_3 like M...,Moore Inc,6011499701167585,10/20,845,American Express,kellypace@yahoo.com,Aid worker,155.121.60.58,pt,98.66
5814,Unit 5232 Box 4650\nDPO AE 28335-7543,71 So,PM,Mozilla/5.0 (X11; Linux i686) AppleWebKit/5342...,Garcia LLC,30346960979608,07/17,402,American Express,jrice@gmail.com,Solicitor,165.48.161.188,zh,96.73
5875,"8256 Anderson Forest\nFordbury, PA 81027-8980",17 Oe,AM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Kelly, Peterson and Oliver",5173335726386576,02/18,954,American Express,hernandezandrea@yahoo.com,Community development worker,212.168.246.27,ru,95.07
5895,"87003 Jason Tunnel Apt. 216\nDariusville, MS 8...",72 gL,AM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Reyes, Fox and Wilson",180010957603245,09/24,929,American Express,duncanmichael@hotmail.com,Event organiser,231.34.199.32,it,97.38
6026,Unit 4385 Box 1428\nDPO AE 04110,58 Ex,AM,Mozilla/5.0 (Windows; U; Windows NT 5.01) Appl...,White Inc,3112975578138572,09/17,7,American Express,scott35@yahoo.com,Operations geologist,217.6.202.138,en,95.89
6524,"344 Rivera Shore Apt. 224\nJoshuaborough, ND 3...",44 SM,AM,Opera/8.62.(X11; Linux i686; en-US) Presto/2.9...,"Lawson, Moyer and Valencia",379348662534664,06/17,809,American Express,olsonjohn@hotmail.com,"Teacher, primary school",45.1.104.55,zh,97.87
7239,"81561 Stein Rue\nEast Melissaport, MA 64959",45 sZ,PM,Mozilla/5.0 (X11; Linux i686) AppleWebKit/5310...,Smith Ltd,503825682670,07/19,852,American Express,beckerjennifer@gmail.com,"Engineer, energy",50.107.135.203,fr,97.32
7381,"40804 Belinda Roads Apt. 186\nWest Nicoleberg,...",30 GH,AM,Opera/9.32.(Windows NT 4.0; it-IT) Presto/2.9....,Blair-Keith,180089858618619,05/19,2107,American Express,woodsmatthew@walton.org,Fashion designer,223.87.136.82,es,99.81
7416,"1082 Jason Alley Suite 707\nWhitestad, SC 97805",08 bm,PM,Mozilla/5.0 (Windows NT 5.1; sl-SI; rv:1.9.2.2...,"Carroll, Harrison and Escobar",3088903707645291,12/18,220,American Express,gcruz@butler.com,Broadcast presenter,193.90.91.152,pt,96.09
7514,"678 David Manor Suite 323\nBobbymouth, PW 59942",91 NA,AM,Mozilla/5.0 (compatible; MSIE 8.0; Windows 98;...,"Glenn, Lowe and Shah",676298897445,04/26,61,American Express,tammy75@cameron.com,Automotive engineer,37.241.180.247,ru,98.36
8233,"327 Hamilton Hollow\nEast Nicolechester, RI 65868",53 dE,PM,Mozilla/5.0 (Macintosh; U; PPC Mac OS X 10_5_3...,"Keller, Carter and Garcia",30299608736429,08/22,786,American Express,elliskaren@taylor.com,Chemical engineer,131.34.220.138,en,98.63
8381,"274 Wallace Pine Apt. 189\nMartinberg, WY 7548...",32 rI,PM,Mozilla/5.0 (Windows; U; Windows 98; Win 9x 4....,Kelly-Newman,5527104423944290,05/18,711,American Express,joneswilliam@cox.net,"Surveyor, land/geomatics",29.211.114.191,ru,99.36
8408,Unit 4967 Box 4574\nDPO AP 11412,05 zs,PM,Mozilla/5.0 (compatible; MSIE 5.0; Windows 98;...,Acevedo-Smith,3337721305744244,01/19,738,American Express,nunezjames@hotmail.com,"Designer, exhibition/display",91.55.254.144,es,98.16
8434,"474 Gonzalez Meadow Suite 581\nEast Vincent, M...",14 St,PM,Mozilla/5.0 (compatible; MSIE 6.0; Windows NT ...,Miller and Sons,180059754370698,07/24,812,American Express,vtaylor@hatfield.com,Armed forces technical officer,26.69.128.20,it,97.90
8817,"3658 Campos Lodge\nChambersfurt, MH 86260",24 ej,PM,Mozilla/5.0 (compatible; MSIE 5.0; Windows NT ...,Fisher-Jones,210046575239925,09/25,860,American Express,jessica35@hotmail.com,Forensic scientist,18.74.143.113,fr,99.16
9168,"18782 Hall Row Suite 810\nSouth Wesleyville, I...",15 QU,PM,Opera/9.57.(X11; Linux i686; it-IT) Presto/2.9...,Butler PLC,5412611065926441,05/25,49,American Express,tammyblair@yahoo.com,Computer games developer,2.84.51.133,en,98.59
9856,"058 Miranda Locks Suite 792\nPort Davidstad, P...",73 IW,PM,Mozilla/5.0 (Windows NT 5.0) AppleWebKit/5360 ...,Olson-Navarro,6011037226242937,03/18,757,American Express,brendastewart@dalton.info,Site engineer,96.79.250.154,de,99.97

In [779]:
ecom [(ecom ['CC Provider'] == 'American Express') & (ecom ['Purchase Price'] > 95)].count()

Address             39
Lot                 39
AM or PM            39
Browser Info        39
Company             39
Credit Card         39
CC Exp Date         39
CC Security Code    39
CC Provider         39
Email               39
Job                 39
IP Address          39
Language            39
Purchase Price      39
dtype: int64

In [781]:
ecom.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [795]:
sum (ecom ['CC Exp Date'].apply(lambda x: x[3:]) == '25')

1033

In [804]:
ecom ['Email'].apply(lambda x: x.split('@')[1]).value_counts().head(5)

hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: Email, dtype: int64

In [805]:
ecom

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,"966 Castaneda Locks\nWest Juliafurt, CO 96415",92 XI,PM,Mozilla/5.0 (Windows NT 5.1) AppleWebKit/5352 ...,Randall-Sloan,342945015358701,03/22,838,JCB 15 digit,iscott@wade-garner.com,Printmaker,29.73.197.114,it,82.21
9996,"832 Curtis Dam Suite 785\nNorth Edwardburgh, T...",41 JY,AM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Hale, Collins and Wilson",210033169205009,07/25,207,JCB 16 digit,mary85@hotmail.com,Energy engineer,121.133.168.51,pt,25.63
9997,Unit 4434 Box 6343\nDPO AE 28026-0283,74 Zh,AM,Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_7...,Anderson Ltd,6011539787356311,05/21,1,VISA 16 digit,tyler16@gmail.com,Veterinary surgeon,156.210.0.254,el,83.98
9998,"0096 English Rest\nRoystad, IA 12457",74 cL,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_8;...,Cook Inc,180003348082930,11/17,987,American Express,elizabethmoore@reid.net,Local government officer,55.78.26.143,es,38.84
9999,"40674 Barrett Stravenue\nGrimesville, WI 79682",64 Hr,AM,Mozilla/5.0 (X11; Linux i686; rv:1.9.5.20) Gec...,Greene Inc,4139972901927273,02/19,302,JCB 15 digit,rachelford@vaughn.com,"Embryologist, clinical",176.119.198.199,el,67.59

In [806]:
ecom.head(5)

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [807]:
ecom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
Address             10000 non-null object
Lot                 10000 non-null object
AM or PM            10000 non-null object
Browser Info        10000 non-null object
Company             10000 non-null object
Credit Card         10000 non-null int64
CC Exp Date         10000 non-null object
CC Security Code    10000 non-null int64
CC Provider         10000 non-null object
Email               10000 non-null object
Job                 10000 non-null object
IP Address          10000 non-null object
Language            10000 non-null object
Purchase Price      10000 non-null float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

In [808]:
ecom['Purchase Price'].mean()

50.34730200000025

In [809]:
ecom['Purchase Price'].min()

0.0

In [810]:
ecom['Purchase Price'].max()

99.99

In [815]:
ecom [ecom ['Language'] == 'en']['Language'].value_counts()

en    1098
Name: Language, dtype: int64

In [820]:
ecom [ecom ['Job'] == 'Lawyer']['Job'].value_counts()

Lawyer    30
Name: Job, dtype: int64

In [825]:
ecom['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

In [826]:
ecom.groupby('AM or PM').count()

,Address,Lot,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
AM or PM,,,,,,,,,,,,,
AM,4932,4932,4932,4932,4932,4932,4932,4932,4932,4932,4932,4932,4932
PM,5068,5068,5068,5068,5068,5068,5068,5068,5068,5068,5068,5068,5068

In [828]:
ecom.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [832]:
ecom['CC Provider'].value_counts()

JCB 16 digit                   1716
VISA 16 digit                  1715
JCB 15 digit                    868
American Express                849
Maestro                         846
Voyager                         829
Discover                        817
Mastercard                      816
VISA 13 digit                   777
Diners Club / Carte Blanche     767
Name: CC Provider, dtype: int64

In [835]:
ecom ['Job'].value_counts().head(5)

Interior and spatial designer    31
Lawyer                           30
Social researcher                28
Designer, jewellery              27
Purchasing manager               27
Name: Job, dtype: int64

In [838]:
ecom[ecom ["Lot"] == '90 WT']['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

In [839]:
ecom.head(2)

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73

In [843]:
ecom [ecom ['Credit Card'] == 4926535242672853]['Email']

1234    bondellen@williams-garza.com
Name: Email, dtype: object

In [848]:
ecom[(ecom ['CC Provider'] == 'American Express') & (ecom ['Purchase Price'] > 95)].count()

Address             39
Lot                 39
AM or PM            39
Browser Info        39
Company             39
Credit Card         39
CC Exp Date         39
CC Security Code    39
CC Provider         39
Email               39
Job                 39
IP Address          39
Language            39
Purchase Price      39
dtype: int64

In [857]:
ecom [ecom ['CC Exp Date'].apply(lambda x: x[3:] == '25')].count()

Address             1033
Lot                 1033
AM or PM            1033
Browser Info        1033
Company             1033
Credit Card         1033
CC Exp Date         1033
CC Security Code    1033
CC Provider         1033
Email               1033
Job                 1033
IP Address          1033
Language            1033
Purchase Price      1033
dtype: int64

In [859]:
ecom ['Email'].apply(lambda x: x.split('@')[1]).value_counts().head(5)

hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: Email, dtype: int64

In [861]:
#NEW DATASET FROM KAGGLE
#MOVIES FROM STREANING PLATFORMS

In [2]:
import numpy as np
import pandas as pd

In [3]:
ott = pd.read_csv('MoviesOnStreamingPlatforms_updated.csv')

In [4]:
ott.head()

,Unnamed: 0,ID,Title,Year,Age,IMDb,Rotten Tomatoes,Netflix,Hulu,Prime Video,Disney+,Type,Directors,Genres,Country,Language,Runtime
0,0,1,Inception,2010,13+,8.8,87%,1,0,0,0,0,Christopher Nolan,"Action,Adventure,Sci-Fi,Thriller","United States,United Kingdom","English,Japanese,French",148.0
1,1,2,The Matrix,1999,18+,8.7,87%,1,0,0,0,0,"Lana Wachowski,Lilly Wachowski","Action,Sci-Fi",United States,English,136.0
2,2,3,Avengers: Infinity War,2018,13+,8.5,84%,1,0,0,0,0,"Anthony Russo,Joe Russo","Action,Adventure,Sci-Fi",United States,English,149.0
3,3,4,Back to the Future,1985,7+,8.5,96%,1,0,0,0,0,Robert Zemeckis,"Adventure,Comedy,Sci-Fi",United States,English,116.0
4,4,5,"The Good, the Bad and the Ugly",1966,18+,8.8,97%,1,0,1,0,0,Sergio Leone,Western,"Italy,Spain,West Germany",Italian,161.0

In [5]:
ott.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16744 entries, 0 to 16743
Data columns (total 17 columns):
Unnamed: 0         16744 non-null int64
ID                 16744 non-null int64
Title              16744 non-null object
Year               16744 non-null int64
Age                7354 non-null object
IMDb               16173 non-null float64
Rotten Tomatoes    5158 non-null object
Netflix            16744 non-null int64
Hulu               16744 non-null int64
Prime Video        16744 non-null int64
Disney+            16744 non-null int64
Type               16744 non-null int64
Directors          16018 non-null object
Genres             16469 non-null object
Country            16309 non-null object
Language           16145 non-null object
Runtime            16152 non-null float64
dtypes: float64(2), int64(8), object(7)
memory usage: 2.2+ MB

In [12]:
ott [ott ['Genres'] == 'Action,Sci-Fi']['Netflix'].count()

46

In [19]:
ott [ott ['Genres'] == 'Western']['Hulu'].count()

116

In [21]:
ott.head()

,Unnamed: 0,ID,Title,Year,Age,IMDb,Rotten Tomatoes,Netflix,Hulu,Prime Video,Disney+,Type,Directors,Genres,Country,Language,Runtime
0,0,1,Inception,2010,13+,8.8,87%,1,0,0,0,0,Christopher Nolan,"Action,Adventure,Sci-Fi,Thriller","United States,United Kingdom","English,Japanese,French",148.0
1,1,2,The Matrix,1999,18+,8.7,87%,1,0,0,0,0,"Lana Wachowski,Lilly Wachowski","Action,Sci-Fi",United States,English,136.0
2,2,3,Avengers: Infinity War,2018,13+,8.5,84%,1,0,0,0,0,"Anthony Russo,Joe Russo","Action,Adventure,Sci-Fi",United States,English,149.0
3,3,4,Back to the Future,1985,7+,8.5,96%,1,0,0,0,0,Robert Zemeckis,"Adventure,Comedy,Sci-Fi",United States,English,116.0
4,4,5,"The Good, the Bad and the Ugly",1966,18+,8.8,97%,1,0,1,0,0,Sergio Leone,Western,"Italy,Spain,West Germany",Italian,161.0

In [42]:
countries = ott['Country']

In [43]:
countries

0        United States,United Kingdom
1                       United States
2                       United States
3                       United States
4            Italy,Spain,West Germany
                     ...
16739                   United States
16740                   United States
16741                   United States
16742                   United States
16743                   United States
Name: Country, Length: 16744, dtype: object

In [44]:
def countryfinder (x):
    count = 0
    if 'united states' in x.lower().split():
        count = count + 1
        return

In [47]:
countries.apply(countryfinder).sum()

AttributeError: 'float' object has no attribute 'lower'

In [40]:
ott

,Unnamed: 0,ID,Title,Year,Age,IMDb,Rotten Tomatoes,Netflix,Hulu,Prime Video,Disney+,Type,Directors,Genres,Country,Language,Runtime
0,0,1,Inception,2010,13+,8.8,87%,1,0,0,0,0,Christopher Nolan,"Action,Adventure,Sci-Fi,Thriller","United States,United Kingdom","English,Japanese,French",148.0
1,1,2,The Matrix,1999,18+,8.7,87%,1,0,0,0,0,"Lana Wachowski,Lilly Wachowski","Action,Sci-Fi",United States,English,136.0
2,2,3,Avengers: Infinity War,2018,13+,8.5,84%,1,0,0,0,0,"Anthony Russo,Joe Russo","Action,Adventure,Sci-Fi",United States,English,149.0
3,3,4,Back to the Future,1985,7+,8.5,96%,1,0,0,0,0,Robert Zemeckis,"Adventure,Comedy,Sci-Fi",United States,English,116.0
4,4,5,"The Good, the Bad and the Ugly",1966,18+,8.8,97%,1,0,1,0,0,Sergio Leone,Western,"Italy,Spain,West Germany",Italian,161.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16739,16739,16740,The Ghosts of Buxley Hall,1980,NaN,6.2,NaN,0,0,0,1,0,Bruce Bilson,"Comedy,Family,Fantasy,Horror",United States,English,120.0
16740,16740,16741,The Poof Point,2001,7+,4.7,NaN,0,0,0,1,0,Neal Israel,"Comedy,Family,Sci-Fi",United States,English,90.0
16741,16741,16742,Sharks of Lost Island,2013,NaN,5.7,NaN,0,0,0,1,0,Neil Gelinas,Documentary,United States,English,NaN
16742,16742,16743,Man Among Cheetahs,2017,NaN,6.6,NaN,0,0,0,1,0,Richard Slater-Jones,Documentary,United States,English,NaN
16743,16743,16744,In Beaver Valley,1950,NaN,NaN,NaN,0,0,0,1,0,James Algar,"Documentary,Short,Family",United States,English,32.0

In [48]:
#PANDAS EXERCISES

In [49]:
print(pd.__version__)

0.25.1

In [50]:
print(pd.show_versions (as_json=True))

{'system': {'commit': None, 'python': '3.7.4.final.0', 'python-bits': 64, 'OS': 'Windows', 'OS-release': '10', 'machine': 'AMD64', 'processor': 'Intel64 Family 6 Model 37 Stepping 2, GenuineIntel', 'byteorder': 'little', 'LC_ALL': 'None', 'LANG': 'None', 'LOCALE': 'None.None'}, 'dependencies': {'pandas': '0.25.1', 'numpy': '1.16.5', 'pytz': '2019.3', 'dateutil': '2.8.0', 'pip': '19.2.3', 'setuptools': '41.4.0', 'Cython': '0.29.13', 'pytest': '5.2.1', 'hypothesis': None, 'sphinx': '2.2.0', 'blosc': None, 'feather': None, 'xlsxwriter': '1.2.1', 'lxml.etree': '4.4.1', 'html5lib': '1.0.1', 'pymysql': None, 'psycopg2': None, 'jinja2': '2.10.3', 'IPython': '7.8.0', 'pandas_datareader': None, 'bs4': '4.8.0', 'bottleneck': '1.2.1', 'fastparquet': None, 'gcsfs': None, 'matplotlib': '3.1.1', 'numexpr': '2.7.0', 'odfpy': None, 'openpyxl': '3.0.0', 'pandas_gbq': None, 'pyarrow': None, 'pytables': None, 's3fs': None, 'scipy': '1.3.1', 'sqlalchemy': '1.3.9', 'tables': '3.5.2', 'xarray': None, 'xlrd': '1.2.0', 'xlwt': '1.3.0'}}
None

In [52]:
a_list = list('abcdefg')
numpy_array = np.arange(1,10)
dictionary = {'A': 0, 'B':1, 'C':2, 'D':3, 'E':5}

In [53]:
pd.Series(a_list)

0    a
1    b
2    c
3    d
4    e
5    f
6    g
dtype: object

In [54]:
pd.Series(numpy_array)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

In [55]:
pd.Series(dictionary)

A    0
B    1
C    2
D    3
E    5
dtype: int64

In [65]:
# input
mylist = list('abcdefghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)
print(ser[:5])

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [67]:
ser

a     0
b     1
c     2
d     3
e     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int64

In [75]:
ser_df = pd.DataFrame(ser)
ser_df.reset_index()

   index   0
0      a   0
1      b   1
2      c   2
3      d   3
4      e   4
5      f   5
6      g   6
7      h   7
8      i   8
9      j   9
10     k  10
11     l  11
12     m  12
13     n  13
14     o  14
15     p  15
16     q  16
17     r  17
18     s  18
19     t  19
20     u  20
21     v  21
22     w  22
23     x  23
24     y  24
25     z  25

In [74]:
pd.DataFrame(myarr)

     0
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10
11  11
12  12
13  13
14  14
15  15
16  16
17  17
18  18
19  19
20  20
21  21
22  22
23  23
24  24
25  25

In [76]:
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [86]:
ser_df = pd.concat([ser1,ser2],axis =1)
ser_df = pd.DataFrame ({'col1':ser1,'col2':ser2})

In [87]:
ser_df

   col1  col2
0     a     0
1     b     1
2     c     2
3     e     3
4     d     4
5     f     5
6     g     6
7     h     7
8     i     8
9     j     9
10    k    10
11    l    11
12    m    12
13    n    13
14    o    14
15    p    15
16    q    16
17    r    17
18    s    18
19    t    19
20    u    20
21    v    21
22    w    22
23    x    23
24    y    24
25    z    25

In [92]:
esther = np.linspace (10,20,7)
owolu = ['aa','bb','cc','dd','ee','ff','gg']

In [95]:
esther

array([10.        , 11.66666667, 13.33333333, 15.        , 16.66666667,
       18.33333333, 20.        ])

In [96]:
owolu

['aa', 'bb', 'cc', 'dd', 'ee', 'ff', 'gg']

In [98]:
ess = pd.DataFrame({'Esther': esther, 'Owolu': owolu})

In [102]:
ess.reset_index()

   index     Esther Owolu
0      0  10.000000    aa
1      1  11.666667    bb
2      2  13.333333    cc
3      3  15.000000    dd
4      4  16.666667    ee
5      5  18.333333    ff
6      6  20.000000    gg

In [103]:
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

In [105]:
ser.rename('Alphabets')

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
Name: Alphabets, dtype: object

In [106]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [109]:
state = np.random.RandomState(100)
ser = pd.Series(state.normal(10, 5, 25))

In [112]:
ser

0      1.251173
1     11.713402
2     15.765179
3      8.737820
4     14.906604
5     12.571094
6     11.105898
7      4.649783
8      9.052521
9     11.275007
10     7.709865
11    12.175817
12     7.082025
13    14.084235
14    13.363604
15     9.477944
16     7.343598
17    15.148663
18     7.809322
19     4.408409
20    18.094908
21    17.708026
22     8.740604
23     5.787821
24    10.922593
dtype: float64

In [113]:
ser.describe()

count    25.000000
mean     10.435437
std       4.253118
min       1.251173
25%       7.709865
50%      10.922593
75%      13.363604
max      18.094908
dtype: float64

In [117]:
np.percentile(ser, q = [0, 25, 50, 75])

array([ 1.25117263,  7.70986507, 10.92259345, 13.36360403])

In [118]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

In [119]:
ser

0     g
1     h
2     b
3     c
4     a
5     g
6     b
7     b
8     c
9     d
10    g
11    a
12    f
13    f
14    b
15    c
16    c
17    c
18    d
19    a
20    a
21    c
22    g
23    f
24    c
25    d
26    b
27    e
28    d
29    b
dtype: object

In [127]:
pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size = 30))).value_counts()

g    6
e    4
h    4
a    4
b    3
f    3
d    3
c    3
dtype: int64

In [137]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))
ser.max()

4

In [139]:
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
ser.value_counts()

4        5
1        4
Other    3
dtype: int64

In [140]:
ser = pd.Series(np.random.randint(1, 10, 35))
ser

0     2
1     9
2     5
3     4
4     4
5     9
6     3
7     5
8     7
9     1
10    7
11    9
12    6
13    6
14    8
15    4
16    3
17    5
18    6
19    9
20    7
21    3
22    1
23    4
24    4
25    5
26    5
27    6
28    9
29    7
30    6
31    4
32    3
33    8
34    8
dtype: int32

In [158]:
newdf = pd.DataFrame(ser.values.reshape(7,5))

In [159]:
newdf

   0  1  2  3  4
0  2  9  5  4  4
1  9  3  5  7  1
2  7  9  6  6  8
3  4  3  5  6  9
4  7  3  1  4  4
5  5  5  6  9  7
6  6  4  3  8  8

In [160]:
ser = pd.Series(np.random.randint(1, 5, 10))
ser

0    1
1    1
2    3
3    1
4    1
5    3
6    1
7    1
8    3
9    1
dtype: int32

In [162]:
def three (x):
    if x%3 == 0:
        return True
    else:
        return False

In [174]:
ser[ser.apply(three)]

2    3
5    3
8    3
dtype: int32

In [180]:
ser.where(lambda x: x % 3 == 0).dropna()

2    3.0
5    3.0
8    3.0
dtype: float64

In [181]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

In [183]:
ser.iloc[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

In [184]:
ser.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

In [185]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

In [194]:
pd.concat([ser1,ser2], axis = 0)

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

In [195]:
pd.concat([ser1,ser2], axis = 1)

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [196]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

In [202]:
des = ser1[ser1.isin(ser2)]

In [204]:
des.index

Int64Index([0, 4, 5, 8], dtype='int64')

In [205]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

In [207]:
np.mean((truth - pred)**2)

0.5472542170226862

In [208]:
ser = pd.Series(['just', 'a', 'random', 'list'])
ser

0      just
1         a
2    random
3      list
dtype: object

In [210]:
def capslock (x):
    x [:1] == x.upper()
    return

In [211]:
ser.apply(capslock)

0    None
1    None
2    None
3    None
dtype: object

In [212]:
[i.title() for i in ser]

['Just', 'A', 'Random', 'List']

In [216]:
ser.map(lambda x: x.title())

0      Just
1         A
2    Random
3      List
dtype: object

In [217]:
ser.map(lambda x: x[0].upper() + x[1:])

0      Just
1         A
2    Random
3      List
dtype: object

In [218]:
ser.map(len)

0    4
1    1
2    6
3    4
dtype: int64

In [219]:
ser.apply(len)

0    4
1    1
2    6
3    4
dtype: int64

In [224]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [225]:
ser

0         01 Jan 2010
1          02-02-2011
2            20120303
3          2013/04/04
4          2014-05-05
5    2015-06-06T12:20
dtype: object

In [226]:
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [227]:
pd.to_datetime(ser).dt.day.to_list()

[1, 2, 3, 4, 5, 6]

In [228]:
pd.to_datetime(ser).dt.week.to_list()

[53, 5, 9, 14, 19, 23]

In [230]:
pd.to_datetime(ser).dt.weekofyear.to_list()

[53, 5, 9, 14, 19, 23]

In [231]:
pd.to_datetime(ser).dt.weekday_name.to_list()

['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']